asciiart-load-test.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: https://www.saucedemo.com/
  phases:
    - duration: 60      # run first phase for 1 minute
      arrivalRate: 5    # 5 new users per second
      rampTo: 5         # keep the same load
      name: Warm up phase
    - duration: 60      # run second phase for 1 minute
      arrivalRate: 20    
      rampTo: 30 
      name: Ramp up load
    - duration: 60
      arrivalRate: 50
      rampTo: 70
      name: Spike phasedd
  # Load & configure a couple of useful plugins
  # https://artillery.io/docs/reference/extensions
  plugins:
    ensure:
      thresholds:
        - http.response_time.p99: 100
        - http.response_time.p95: 75
    apdex:
      threshold: 100
    metrics-by-endpoint: {}
scenarios:
  - name: "Browse main pages"
  - flow:
      - loop:
          - get:
              url: '/inventory.html'
          # - get:
          #     url: '/inventory.html'
          # - get:
          #     url: '/'
        count: 100